---
kind: method
id: M:Autodesk.Revit.DB.ExportLayerInfo.RemoveLayerModifier(Autodesk.Revit.DB.LayerModifier)
source: html/eeb920e3-7092-3aed-622f-869c6f7b2c84.htm
---
# Autodesk.Revit.DB.ExportLayerInfo.RemoveLayerModifier Method

Removes a project layer modifier from the layer info.

## Syntax (C#)
```csharp
public void RemoveLayerModifier(
	LayerModifier layerModifier
)
```

## Parameters
- **layerModifier** (`Autodesk.Revit.DB.LayerModifier`) - The project layer modifier.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null